; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l9-t1-p6---int100n150-m25---int100c110---s170---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level47 level24 level71)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level48 level24 level72)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level19 level70)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level19 level71)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level19 level72)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level13 level71)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level13 level72)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level63 level3 level66)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level64 level3 level67)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level65 level3 level68)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level66 level3 level69)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level67 level3 level70)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level68 level3 level71)
(sum level68 level4 level72)
(sum level69 level3 level72)

(connected l0 l1)
(fuelcost level22 l0 l1)
(connected l0 l3)
(fuelcost level4 l0 l3)
(connected l0 l4)
(fuelcost level8 l0 l4)
(connected l1 l0)
(fuelcost level22 l1 l0)
(connected l1 l4)
(fuelcost level15 l1 l4)
(connected l1 l5)
(fuelcost level13 l1 l5)
(connected l1 l6)
(fuelcost level5 l1 l6)
(connected l1 l8)
(fuelcost level9 l1 l8)
(connected l2 l5)
(fuelcost level3 l2 l5)
(connected l2 l7)
(fuelcost level7 l2 l7)
(connected l3 l0)
(fuelcost level4 l3 l0)
(connected l3 l4)
(fuelcost level9 l3 l4)
(connected l3 l8)
(fuelcost level6 l3 l8)
(connected l4 l0)
(fuelcost level8 l4 l0)
(connected l4 l1)
(fuelcost level15 l4 l1)
(connected l4 l3)
(fuelcost level9 l4 l3)
(connected l4 l5)
(fuelcost level24 l4 l5)
(connected l5 l1)
(fuelcost level13 l5 l1)
(connected l5 l2)
(fuelcost level3 l5 l2)
(connected l5 l4)
(fuelcost level24 l5 l4)
(connected l5 l7)
(fuelcost level19 l5 l7)
(connected l6 l1)
(fuelcost level5 l6 l1)
(connected l7 l2)
(fuelcost level7 l7 l2)
(connected l7 l5)
(fuelcost level19 l7 l5)
(connected l8 l1)
(fuelcost level9 l8 l1)
(connected l8 l3)
(fuelcost level6 l8 l3)

(at t0 l8)
(fuel t0 level72)
(= (total-cost) 0)

(at p0 l6)
(at p1 l4)
(at p2 l6)
(at p3 l0)
(at p4 l8)
(at p5 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l7)
(at p3 l7)
(at p4 l6)
(at p5 l7)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l8)
   deleted: (at p4 l8)
   added: (in p4 t0)
   goals met: 0 of 6
2. (drive t0 l8 l3 level66 level6 level72)
   deleted: (at t0 l8) (fuel t0 level72)
   added: (at t0 l3) (fuel t0 level66)
   goals met: 0 of 6
3. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 6
4. (drive t0 l3 l0 level62 level4 level66)
   deleted: (at t0 l3) (fuel t0 level66)
   added: (at t0 l0) (fuel t0 level62)
   goals met: 0 of 6
5. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 6
6. (drive t0 l0 l4 level54 level8 level62)
   deleted: (at t0 l0) (fuel t0 level62)
   added: (at t0 l4) (fuel t0 level54)
   goals met: 0 of 6
7. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 6
8. (drive t0 l4 l1 level39 level15 level54)
   deleted: (at t0 l4) (fuel t0 level54)
   added: (at t0 l1) (fuel t0 level39)
   goals met: 0 of 6
9. (drive t0 l1 l6 level34 level5 level39)
   deleted: (at t0 l1) (fuel t0 level39)
   added: (at t0 l6) (fuel t0 level34)
   goals met: 0 of 6
10. (load p0 t0 l6)
   deleted: (at p0 l6)
   added: (in p0 t0)
   goals met: 0 of 6
11. (load p2 t0 l6)
   deleted: (at p2 l6)
   added: (in p2 t0)
   goals met: 0 of 6
12. (unload p4 t0 l6)
   deleted: (in p4 t0)
   added: (at p4 l6)
   goals met: 1 of 6
13. (drive t0 l6 l1 level29 level5 level34)
   deleted: (at t0 l6) (fuel t0 level34)
   added: (at t0 l1) (fuel t0 level29)
   goals met: 1 of 6
14. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 6
15. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 6
16. (drive t0 l1 l5 level16 level13 level29)
   deleted: (at t0 l1) (fuel t0 level29)
   added: (at t0 l5) (fuel t0 level16)
   goals met: 3 of 6
17. (drive t0 l5 l2 level13 level3 level16)
   deleted: (at t0 l5) (fuel t0 level16)
   added: (at t0 l2) (fuel t0 level13)
   goals met: 3 of 6
18. (drive t0 l2 l7 level6 level7 level13)
   deleted: (at t0 l2) (fuel t0 level13)
   added: (at t0 l7) (fuel t0 level6)
   goals met: 3 of 6
19. (unload p2 t0 l7)
   deleted: (in p2 t0)
   added: (at p2 l7)
   goals met: 4 of 6
20. (unload p3 t0 l7)
   deleted: (in p3 t0)
   added: (at p3 l7)
   goals met: 5 of 6
21. (unload p5 t0 l7)
   deleted: (in p5 t0)
   added: (at p5 l7)
   goals met: 6 of 6
